### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_key.ioweb_audit_logs_01 will be created
  + resource "azurerm_key_vault_key" "ioweb_audit_logs_01" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 4096
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01"
      + n                       = (known after apply)
      + name                    = "ioweb-audit-logs-01"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.function_profile_async.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02"
        name                                           = "io-p-itn-auth-profas-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (34 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.storage_account_audit_services.azurerm_storage_container.containers["ioweb-auditlogs-01"] will be created
  + resource "azurerm_storage_container" "containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = (known after apply)
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = {
          + "costcenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "createdby"      = "Terraform"
          + "environment"    = "Prod"
          + "managementteam" = "IO Auth&Identity"
          + "owner"          = "IO"
          + "source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + name                              = "ioweb-auditlogs-01"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.storage_account_audit_services.azurerm_storage_container.containers["lv-logs-01"] will be created
  + resource "azurerm_storage_container" "containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = "lvlogs"
      + encryption_scope_override_enabled = false
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = {
          + "costcenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "createdby"      = "Terraform"
          + "environment"    = "Prod"
          + "managementteam" = "IO Auth&Identity"
          + "owner"          = "IO"
          + "source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + name                              = "lv-logs-01"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.storage_account_audit_services.azurerm_storage_container_immutability_policy.immutability_policies["ioweb-auditlogs-01"] will be created
  + resource "azurerm_storage_container_immutability_policy" "immutability_policies" {
      + id                                    = (known after apply)
      + immutability_period_in_days           = 730
      + locked                                = false
      + protected_append_writes_all_enabled   = false
      + protected_append_writes_enabled       = false
      + storage_container_resource_manager_id = (known after apply)
    }

  # module.storage_account_audit_services.azurerm_storage_container_immutability_policy.immutability_policies["lv-logs-01"] will be created
  + resource "azurerm_storage_container_immutability_policy" "immutability_policies" {
      + id                                    = (known after apply)
      + immutability_period_in_days           = 730
      + locked                                = false
      + protected_append_writes_all_enabled   = false
      + protected_append_writes_enabled       = false
      + storage_container_resource_manager_id = (known after apply)
    }

  # module.storage_accounts.azurerm_management_lock.st_audit_01 will be created
  + resource "azurerm_management_lock" "st_audit_01" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "iopitnauthauditst01"
      + notes      = "This Storage Account can't be deleted"
      + scope      = (known after apply)
    }

  # module.storage_accounts.azurerm_storage_encryption_scope.lvlogs will be created
  + resource "azurerm_storage_encryption_scope" "lvlogs" {
      + id                 = (known after apply)
      + key_vault_key_id   = "https://io-p-itn-auth-kv-01.vault.azure.net/keys/lv-logs-storage-01"
      + name               = "lvlogs"
      + source             = "Microsoft.KeyVault"
      + storage_account_id = (known after apply)
    }

  # module.storage_accounts.azurerm_storage_management_policy.delete_after_2yrs will be created
  + resource "azurerm_storage_management_policy" "delete_after_2yrs" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "lv-logs-01-deleteafter2yrs"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = 731
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = -1
                  + delete_after_days_since_creation_greater_than                  = 731
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = -1
                  + delete_after_days_since_creation                               = 731
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
            }

          + filters {
              + blob_types   = [
                  + "blockBlob",
                ]
              + prefix_match = [
                  + "lv-logs-01/logs",
                ]
            }
        }
      + rule {
          + enabled = true
          + name    = "audit-deleteafter2yrsplus1week"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = 738
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = -1
                  + delete_after_days_since_creation_greater_than                  = 738
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = -1
                  + delete_after_days_since_creation                               = 738
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
            }

          + filters {
              + blob_types   = [
                  + "blockBlob",
                ]
              + prefix_match = [
                  + "ioweb-auditlogs-01/auditlogs",
                ]
            }
        }
    }

  # module.storage_accounts.module.st_audit_01.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitnauthauditst01] Low Availability"
      + resource_group_name      = "io-p-itn-auth-audit-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.storage_accounts.module.st_audit_01.azurerm_private_endpoint.this["blob"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-auth-audit-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-auth-audit-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-auth-audit-blob-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage_accounts.module.st_audit_01.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitnauthauditst01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-auth-audit-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.iam_kv.module.kv_func["0841384e-9cad-453d-b2da-73ed1d079555"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-itn-auth-lollipop-func-02"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/7cd53d61-2256-5426-3c7c-844575c328e5"
        name                                   = "7cd53d61-2256-5426-3c7c-844575c328e5"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["00c42c7a-7fa8-43b8-b250-85d63c29d0cc"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-itn-auth-lollipop-func-02-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/fa0de7c8-2c01-b20c-babf-78d1b89202d3"
        name                                   = "fa0de7c8-2c01-b20c-babf-78d1b89202d3"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["115eb3ca-00ee-4134-ad12-a9daaabff699"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-itn-auth-lv-func-02"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/fe819af4-e2c0-14bf-8178-260ea8e29fcf"
        name                                   = "fe819af4-e2c0-14bf-8178-260ea8e29fcf"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["544c3add-da8b-4fc1-8e4f-0f750cfdafa8"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-itn-auth-lv-func-02-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/cd99701f-52b6-bcb5-10d9-d7bb59830a61"
        name                                   = "cd99701f-52b6-bcb5-10d9-d7bb59830a61"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["c60e62e1-05cb-43d0-a958-9b75153184d2"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-itn-auth-profas-func-02"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/e70ffc6e-a6a2-10f3-aae2-7b1d3b6ca5c8"
        name                                   = "e70ffc6e-a6a2-10f3-aae2-7b1d3b6ca5c8"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["6af06a8e-d9b4-458a-a02f-eee8bd87081e"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-itn-auth-profas-func-02-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/589a6b44-8515-0a7f-00b2-ce73850d8d5a"
        name                                   = "589a6b44-8515-0a7f-00b2-ce73850d8d5a"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["321ab3f4-344b-4672-ab5a-029a4a72c452"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-weu-auth-sm-int-func-01"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/0c9b2c86-5bee-6401-ed7c-2200d455baee"
        name                                   = "0c9b2c86-5bee-6401-ed7c-2200d455baee"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["9f0a1505-260e-46fc-a130-fea5519f7666"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] has moved to module.iam_kv.module.kv_func["io-p-weu-auth-sm-int-func-01-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/91245b8f-f4ef-31aa-e7a6-c28902f1f75c"
        name                                   = "91245b8f-f4ef-31aa-e7a6-c28902f1f75c"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_st["iopitnauthauditst01"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|writer"] will be created
  + resource "azurerm_role_assignment" "keys" {
      + condition_version                = (known after apply)
      + description                      = "Grant write access to Key Vault crypto for provided Storage Account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv.module.kv_st["09ec3b06-f0d4-4517-8dde-95421606b7e0"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|writer"] has moved to module.iam_kv.module.kv_st["iopitnauthsessionst01"].module.key_vault.azurerm_role_assignment.keys["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|writer"]
    resource "azurerm_role_assignment" "keys" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/bcb79de9-f436-d0ce-9036-6d3061d2db8b"
        name                                   = "bcb79de9-f436-d0ce-9036-6d3061d2db8b"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv_ioweb.module.kv_func["fff812bb-3a9e-40fd-8e6c-dcfa6b94b51d"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"] has moved to module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-profile-func-02"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01/providers/Microsoft.Authorization/roleAssignments/6f1b478c-433a-192a-72bc-cf9b60615bd9"
        name                                   = "6f1b478c-433a-192a-72bc-cf9b60615bd9"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv_ioweb.module.kv_func["e3aa2d9e-3eda-406b-a064-f01849edf3cf"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"] has moved to module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-profile-func-02-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01/providers/Microsoft.Authorization/roleAssignments/ff226cc0-3dbe-f808-0679-ca4e2d1e5efc"
        name                                   = "ff226cc0-3dbe-f808-0679-ca4e2d1e5efc"
        # (9 unchanged attributes hidden)
    }

  # module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-function-web-profile-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"] has moved to module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-webprof-func-01-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"]
    resource "azurerm_role_assignment" "secrets" {
        id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01/providers/Microsoft.Authorization/roleAssignments/f81705a5-ce58-20b2-c134-7193b4f5a56b"
        name                                   = "f81705a5-ce58-20b2-c134-7193b4f5a56b"
        # (9 unchanged attributes hidden)
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```

</details>
